[{
    "b_id": "1b7a54e3-c380-468e-9004-187cd5bb6d7e",
    "title": "Создаем нейронную сеть",
    "annotation": "Лучшая книга для углубления в сферу реализации нейронной сети. Руководство рекомендуется тем, кто мечтает создать нейронную сеть самостоятельно, но пока без опыта. В издании разбираются устройство и принцип работы нейронной сети. Есть объяснение, как происходит сглаживание сигналов в нейронных сетях, как тренировать и тестировать нейронные сети. Ещё вы научитесь распознавать образы посредством нейросетей. Кроме объяснения основополагающей теории, в книге представлен код для поэтапной реализации нейросети на Python.",
    "author": "Тарик Рашид",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "e5c4ab18-d614-4d56-9560-2847da44fe99",
    "title": "Программирование на Java для начинающих",
    "annotation": "Российский компьютерный бестселлер. Здесь даются подробные и понятные инструкции для самостоятельного освоения Java с нуля. Книга подходит и для начинающих, и для программистов, знакомых с принципами объектно-ориентированного программирования. Это руководство затрагивает основополагающие методы разработки с самого начала: классов и объектов. После прочтения вы cможете сами создать приложение с графическим интерфейсом на Java.",
    "author": "А.Н. Васильев",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "0b53f0c5-9dd6-4960-ba82-f545d8ce75b7",
    "title": "Введение в машинное обучение с помощью Python. Руководство для специалистов по работе с данными",
    "annotation": "Сборник практических приёмов создания систем машинного обучения. Именно с этого руководства удобно начинать знакомство с популярной областью анализа. Авторы подробно объясняют методы и типы машинного обучения, иллюстрируя примерами на Python. В этом руководстве сделан упор на практику без лишних теоретических доказательств. В результате читатель овладеет ключевыми научными инструментами Python и создаст персональную систему машинного обучения в интересующей сфере.",
    "author": "Андреас Мюллер, Сара Гвидо",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "48c7fc82-eafb-4372-9c9c-887245ffb5cc",
    "title": "Алгоритмы. Справочник с примерами на C, C++, Java и Python",
    "annotation": "Откровение о повышении производительности программ при помощи правильных алгоритмов. Книга подойдёт практикующим разработчикам и проектировщикам программных продуктов. В обновлённую версию включены дополнительные виды  сортировки, алгоритм Форчуна и древовидные структуры. В общем в книге предлагается 40 алгоритмов для поиска решений. Реализация алгоритмов приводится на различных языках: Java, Python, C и C++. Вы научитесь подбирать подходящие алгоритмы, правильно давать оценку их производительности и достигать высокой результативности.",
    "author": "Джордж Хайнеман, Гари Поллис, Стэнли Селков",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "b2bdcf09-bbf9-4aee-8c29-302042360a85",
    "title": "Чистый Python. Тонкости программирования для профи",
    "annotation": "Это золотой фонд практических приёмов и общих правил Python. Книга раскрывает тонкости стандартной библиотеки и показывает, как применять их на практике. Обязательна к прочтению для тех, кто давно мечтал писать чистый код и освоить сложные трюки языка. Также будет полезна тем, кто только задумался перейти на Python. Автор рассказывает, как ускорить работу приложений, написанных на старых версиях Python. Разработчик ядра Python Мариатта Виджайя рекомендует.",
    "author": "Дэн Бейдер",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "ccf14910-d11d-4ae2-acba-9b15765f1805",
    "title": "Глубокое обучение. Погружение в мир нейронных сетей",
    "annotation": "Наконец получится понять машинное обучение и вникнуть в теорию. Учёные рассказывают об истории создания искусственных нейросетей и революции в их обучении. В увлекательной форме исследуются основные и современные архитектуры, а также их применение. Руководство содержит много серьёзных объяснений: от теоремы Байеса и основ градиентного спуска до глубокого обучения с подкреплением и нейробайесовых методов.",
    "author": "Сергей Николенко, А. Кадурин, Екатерина Архангельская",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "3b020499-1c30-4a6c-ab04-279ce5808472",
    "title": "Дискретная математика для программистов",
    "annotation": "Сенсационная книга в области дискретной математики. Благодаря доступной и увлекательной подаче, руководство подходит для начинающих. В этой книге много примеров, которые иллюстрируют понятия логики, множеств, графов, отношений и булевых функций. В новом издании фундаментальные концепции дискретной математики дополняются задачами теории графов и целочисленного программирования. Кроме того, рассматриваются рекурсивные алгоритмы и общая проблема перебора.",
    "author": "Род Хаггарти",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "60126193-6019-47b6-a044-53a88e1b8359",
    "title": "NoSQL. Новая методология разработки нереляционных баз данных",
    "annotation": "Полное руководство по работе с нереляционными базами данных NoSQL. Кратко и доходчиво авторы объясняют основы технологии и знакомят новичков с базовыми концепциями. В этом издании описываются преимущества NoSQL над реляционными базами. Также рассматриваются типы хранилищ, современные модели распределения, согласованность и штампы версий. Книга помогает освоить архитектурные приёмы и демонстрирует их реализацию.",
    "author": "Прамодкумар Дж. Садаладж, Мартин Фаулер",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "ded03d53-960c-45e9-a306-5955db7c51c8",
    "title": "Алгоритмы для чайников",
    "annotation": "Книга из разряда вечной классики для начинающих. Это руководство по применению алгоритмов в повседневных задачах. Кроме определений алгоритмов, структурирования и графов, авторы показывают, как работать с большими данными и решать сложные задачи. Для иллюстрации алгоритмов в издании используется Python. Бонусом будут 10 алгоритмов, которые изменили мир, и 10 нерешённых алгоритмических проблем.",
    "author": "Джон Поль Мюллер, Лука Массарон",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  },
  {
    "b_id": "3a87d1ed-ff31-4d6b-9e1d-8c1c4a5278a2",
    "title": "Использование Docker",
    "annotation": "Популярное руководство по использованию Docker. Книга будет полезной программистам, системным администраторам и специалистам по эксплуатации. В нынешнюю эпоху DevOps ценится умение запускать контейнеры и сопровождать сложнейшие системы в динамической среде. Потому стоит научиться использовать Docker в процессе разработки софта и развёртывания приложения. В книге детально рассматриваются этапы этого процесса.",
    "author": "Эдриен Моуэт",
    "picture": "http://placehold.it/228x346",
    "publication_date": 2018
  }
]